In [ ]:
# 화면에 표시할 행과 열의 최대 갯 수
import pandas as pd
df_auto = pd.read_csv('dataset/auto-mpg.csv')

pd.options.display.max_rows = 9
pd.options.display.max_columns = 10

# pd.set_option('max_rows', 5)
# pd.set_option('max_columns', 10)

df_auto

In [ ]:
# df_auto 데이터 세트에 대한 파악 내용을 기술하세요.
# df_auto.info() # 데이터 정보
# df_auto.shape # 데이터 형태 파악
df_auto.describe() # 데이터 요약

In [ ]:
mcar.horsepower.value_counts() # 값이 몇개 있는지
mcar.horsepower.unique()

In [ ]:
df_auto.columns

In [ ]:
pd.options.display.max_rows = 5
columns = ['car name', 'mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model year', 'origin']

mtcars = df_auto[columns] #af_auto의 컬럼명을[columns라는 변수]로 변경
mtcars.to_csv('dataset/mtcars.csv',index=None) # index=None 해서 빈 공간 X index_col=car name / car name이 인덱스로 변경 됨

mtcars = pd.read_csv('dataset/mtcars.csv')
mtcars

In [ ]:
# 원하는 행과 열 선택
import warnings
mtcar_3 = df_auto.head(3) # 앞에서 3개의 행만 표시
mtcar_3.drop('car name',axis=1,inplace=True) # car name 을 삭제하고 나머지 열만 표시
mtcar_3

In [ ]:
mtcars_2 = mtcars[['car name','mpg', 'model year']] # 필요한 열만 가져오기
mtcars_2

In [ ]:
# 필요한 행과 열만 가져오기
mtcars_2 = mtcars[['car name','mpg', 'model year']][5:8]
mtcars_2

In [ ]:
mtcars_4 = mtcars.iloc[5:8,0:6] # iloc로 행과 열 선택 추출
mtcars_4

In [ ]:
# 과제
# iloc, loc를 사용하여 다른 방법으로 
# mtcars[['car name','mpg', 'model year']][5:8] 와 동일하게 출력하세요.

In [ ]:
mcar = mtcars.copy()
mcar1 = mcar.set_index('car name') # car name 을 인덱스로 사용
mcar1

In [ ]:
mcar = mcar1.reset_index() # 인덱스를 원래대로 복원
mcar

In [ ]:
mcar.to_csv('dataset/mcar.csv',index=None)
mcar = pd.read_csv('dataset/mcar.csv')
mcar

In [ ]:
pd.set_option('max_rows', 10)
pd.set_option('max_columns', 10)
mcar.describe()
# mcar.mpg.describe() #mpg의 값만 보고 싶을 때
# 정규화 할 때 max값 min값을 0 ~ 1 단위로 바꾸기 (상대적으로 모든 값을 일정하게 맞춤)
# 이상치(outlier) : 특정 평균보다 차이가 많이 나는 값
# 정규화 : 데이터를 상대적 크기에 대한 영향을 줄이기 위해 데이터 범위를 0~1사이로 바꾸는것
# 표준화 : 데이터가 평균으로 부터 얼마나 떨어져있는지 나타내는 값. (특정 범위를 벗어난 데이터는 제거)

In [ ]:
mcar.info()
# horsepower가 문자열인 이유 = 중간에 ?가 껴 있음
# sickit-learn을 사용할 때 문자열을 숫자로 바꿔줘야 됨
# 값의 스케일이 커지면 정규화를 진행해야됨(스케일이 큰 컬럼이 모델에 반영되는 영향력이 높아짐 그래서 일정하게 정규화를 진행해야됨)
# 정규화란? : https://velog.io/@wldus9503/%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B2%A0%EC%9D%B4%EC%8A%A4-%EC%A0%95%EA%B7%9C%ED%99%94Normalization%EB%9E%80

In [ ]:
# 자동차 연비에 영향을 주는 변수를 선택하여 연비 예측 모델을 생성
mcar1 = mcar.drop(['car name','horsepower'],axis=1)
mcar1.head()

In [ ]:
import seaborn as sns
sns.pairplot(mcar1) # 산점도 출력

In [ ]:
# 상관 관계 / 0은 관계가 없음 / 일반적으로 0.7 이상이면 높은 상관관계 케바케 / 실제 데이터로 프로젝트시 0.2만 되어도 높다 평가함
mcar1.corr()
# 머신러닝
# 딥러닝은 이미지, 텍스트, 자연어처리, 음성 / 많은 데이터를 줘야하는데 쉽지 않음

In [ ]:
# 최적의 컬럼 선택하여 분석용 데이터 셋 구축 - Feature engineering
mcar2 = mcar1[['mpg','weight']]
mcar2.head()

In [ ]:
# y = ax + b  # x = weight ,a = 기울기 , b = 절편
# y = 3x + 1
# y = 5x + 1
# 좀 더 정확한 기울기를 찾기 : 머신러닝

In [ ]:
# Counter
from collections import Counter
my_list = ['a','b','c','a','b','c','a']
count = Counter(my_list)
print(count)
words = dict(count.most_common(n=2))
print(words) # b가 먼저 나와서 출력됨

In [ ]:
# 반올림
import pandas as pd
import numpy as np

col1 = np.random.uniform(10,20,size=10) # 10 ~ 20 사이의 실수 10개 / 실수 : uniform / 정수 : randint
col2 = np.random.uniform(10,20,size=10)
sr1 = pd.Series(col1,name = 'col1')
sr2 = pd.Series(col2,name = 'col2')
df = pd.concat([sr1,sr2],axis=1)
df = df.round({'col1':2,'col2':1}) # 딕셔너리 키 값 별로 소수점 자리 수 주기(반올림)
df.head(3)

In [ ]:
# 널 값 주기
# df.iloc[1:3,:] = None
df.iloc[1:3,:] = np.nan
df.head(3)

In [ ]:
df.fillna(0,inplace=True) # Null 값 채우기 / fillna = na 를 채우는 함수
# df = df.astype(int) # df의 Dtype을 정수로 전부 바꿈
df = df.astype({'col1' : 'int','col2' : 'float'}) # df의 키 값 별로 Dtype을 바꿀 수 있음
df.info()

In [ ]:
df['col0'] = list('abcdefghij')
df.set_index('col0',inplace=True) # col0를 인덱스 값으로 주기
df.head(3)

In [ ]:
df1 = df.copy()
df1.loc['c','col2'] = np.nan # 선택한 행과 열 자리에 Nan값 주기
df1.head()

In [ ]:
# col2의 평균 값을 null값을 대체하세요
# df3 = df1.loc['c','col2'] = df1['col2'].mean()
# df3 = df1.replace(np.nan,df1['col2'].mean())
# df3 = df1.replace(np.nan,df1.describe()['col2']['mean'])
df3 = df1.fillna(df1['col2'].mean())
df3 = df3.round({'col2':2})
df3.head()

In [ ]:
df3 = df3.astype({'col2':'int'}) # col2를 정수로 변환하여 출력
# df3['col2'] = df3.col2.astype(int) # 시리즈로 출력됨
df3.head()

In [ ]:
df3.iloc[1:3,1:2] = np.nan
df3.head()

In [ ]:
# Null 값이 있는 행 삭제
df3.dropna(subset=['col2'],inplace=True)
# df3.dropna(axis=0)
df3.head()

In [ ]:
# df1 = df1.astype({'col2':'int'})
df1 = df1.fillna(df1['col2'].mean())
df1['col2'] = df1.col2.astype(int)
df1

In [ ]:
df2 = df1.reset_index()
df2.head()

In [ ]:
df3 = df2.reindex(index=[1,2],columns=['col1','col2'])
df3

In [ ]:
df4 = df2.reindex(index=[3,4],columns=['col1','col2'])
df4

In [ ]:
# df5 = df2.reindex(columns=['col1','col2'])
df5 = df2.reindex(['col1','col2'],axis=1)
df5.head()

In [ ]:
df6 = df2.reindex([1,3],axis=0)
# df6 = df2.reindex([1,3],axis='index')
df6

In [ ]:
import numpy as np
import pandas as pd
data1 = np.arange(1,21).reshape(4,5)
data2 = np.arange(11,31).reshape(5,4)
df1 = pd.DataFrame(data1,columns=list('abcde'))
df2 = pd.DataFrame(data2,columns=list('dehi'))
print(df1,'\n')
print(df2)

In [ ]:
# con1 = pd.concat([df1,df2],axis=0)
con1 = pd.concat([df1,df2],axis=0, ignore_index=True) #ignore_index = 새로운 인덱스 넘버 부여
con1

In [ ]:
con2 = pd.concat([df1,df2],axis=1)
con2

In [ ]:
df1['ind'] = [1,2,3,4]
df2['ind'] = [1,2,3,4,5]
print(df1,'\n')
print(df2)

In [ ]:
# merge()를 이용한 결합
# on : label or list
#     Column or index level names to join on. These must be found in both
#     DataFrames. If `on` is None and not merging on indexes then this defaults
#     to the intersection of the columns in both DataFrames.
# pd.merge(df1,df2,on='ind',how='outer') # 합집합 공통된 컬럼 기준
pd.merge(df1,df2,on='ind',how='inner') # 교집합 inner = default

In [ ]:
df1 = df1.drop('ind',axis=1)
df2 = df2.drop('ind',axis=1)

In [ ]:
# join은 인덱스 기준으로 결합(default는 교집합)
# df1.join(df2,lsuffix='_1',rsuffix='_2') # 중복된 걸 분리해줌 suffix를 사용하려면 _를 붙여야함
df1.join(df2,lsuffix='_1',rsuffix='_2',how='inner') #default = inner

In [ ]:
df1.join(df2,lsuffix='_1',rsuffix='_2',how='outer') #합집합

In [ ]:
df1['ind'] = [1,2,3,4]
df2['ind'] = [1,2,3,4,5]
print(df1,'\n')
print(df2)

In [ ]:
# index='ind' 기준으로 교집합
df1.set_index('ind').join(df2.set_index('ind'),lsuffix='_1',rsuffix='_2')

In [ ]:
# index='ind' 기준으로 합집합
df1.set_index('ind').join(df2.set_index('ind'),lsuffix='_1',rsuffix='_2',on='ind',how='outer') #on='ind'를 하면 하나의 컬럼으로 처리

In [ ]:
# a, b  컬럼의 평균
print(df1.describe()['a']['mean'])
print(df1.describe()['b']['mean'])

df1[['a','b']].mean()

In [ ]:
df1.count()

In [ ]:

data = np.arange(1,22).reshape(7,3)
df = pd.DataFrame(data,columns=list('123'),index=list('1122333'))
df

In [ ]:
df.reset_index(inplace=True) # 인덱스를 컬럼으로 밀어내고 새로운 인덱스 넘버를 부여
df

In [ ]:
# 과제
#1 index 를 기준으로 3개 그룹으로 구분하여 a:평균, b:최대값, c:합계
def h_sum(s):
    return s.sum()

def h_max(s):
    return s.max()

def h_mean(s):
    return s.mean()
d_g = df.groupby('index')# index 컬럼에 1, 2, 3 별로 그룹을 나눔
d_g.agg({'1':h_mean,'2':h_max,'3':h_sum}) # 1번 컬럼 = h_mean 사용자 함수 적용/ 2번 컬럼 = h_max 함수 적용 / 3번 컬럼 = h_sum 함수 적용

In [ ]:
#2 dec
#  열의 NaN 갯 수를 계산하세요.
import seaborn as sns
titanic_df = sns.load_dataset('titanic')
titanic_df.head()
rs = titanic_df['deck'].isnull().sum()
print('NaN 수는',rs,'개 입니다')

In [ ]:
#3 titanic_df의 처음 5개 행에서 null 값을 찾아 출력하세요 (True,False로)(boolean)
titanic_df[1:6].isnull()

In [ ]:
#4 titanic_df의 각 컬럼별 null의 갯 수를 for 반복문을 사용해서 구한 후 출력
#(missing_count는 예외처리하고 처리 방식은 0을 출력함 / null 값이 없으면 0)
############################################################################
#                   For 문 안쓰고 일괄 처리 하는 방법
# total = titanic_df.isnull().sum()
# total
############################################################################

for i, v in titanic_df.iteritems():
    print(i,v.isnull().sum())

In [ ]:
missing_df = titanic_df.isnull()
for col in missing_df.columns:
    missing_count = missing_df[col].value_counts()
    try:
        print(col,':',missing_count[True])
    except:
        print(col,':',0)

In [ ]:
#5 'mpg'를 'kpl'로 환산하여 새로운 열을 생성하고 처음 3개 행을 소수점 아래
# 둘째 자리에서 반올림하여 출력하세요.
def tran(a):
    result = a * 0.425
    return result 
import pandas as pd
auto_df = pd.read_csv('dataset/auto-mpg.csv')
rsd = auto_df.agg({'mpg':tran})
rsd.rename(columns={'mpg':'kpl'},inplace=True)
rsd[0:3].round(2)

In [ ]:
#6 titanic_df 데이터 셋을 전처리하고 탐색하여 데이터 셋에 대한 설명 및
# 분석 과제를 기술하세요 (전처리 최소 5개 이상)
# 타이타닉 생존률에 영향을 끼친 요인들 파악
import pandas as pd
import missingno as miso # 데이터에서 Null값을 시각화 해주는 라이브러리
pd.set_option('max_columns',15)
#---------------------------------(데이터 탐색)----------------------------------------
#titanic_df.corr() # 데이터 상관관계 파악
miso.matrix(df = titanic_df.iloc[:,:], figsize=(8,8),color=(0.5,0.5,0.5)) # 결측 데이터 탐색  #deck는 선실 고유번호라 생존률이랑 상괸 X
# #데이터 프레임의 행렬을 유무로 파악해 Null 값을 시각화 figsize = 크기 color = RGB

In [ ]:
#-----------------------------------------------------------------------------------
titanic_df.dropna(axis=1,inplace=True) # 결측치가 있는 컬럼을 지움 / 출발지,나이,선실 고유번호,출발지 이니셜
tgen = titanic_df[['sex','survived']].groupby(['sex']).count() # 성별 사람 수 출력
gen = titanic_df[['sex','survived']].groupby(['sex']).sum() # 성별 생존자 수 출력
tcla = titanic_df[['pclass','survived']].groupby(['pclass']).count() # 클래스 별 사람 수 출력
cla = titanic_df[['pclass','survived']].groupby(['pclass']).sum() # 클래스 별 생존자 수

g_t = gen.join(tgen,lsuffix='_1',rsuffix='_total',how='outer') # 성별 생존자 / 탑승자 수
c_t = cla.join(tcla,lsuffix='_1',rsuffix='_total',how='outer') # 객실 등급별 생존자 / 탑승자 수

print('성별 생존자 탑승자 비교')
print(g_t,'\n')
print('객실 등급 별 생존자 탑승자 비교')
print(c_t,'\n')

In [ ]:
# groupby
import seaborn as sns
titanic_df = sns.load_dataset('titanic')
titanic_df.head()

In [ ]:
tdf = titanic_df.copy()
tdf.sex.value_counts()

In [ ]:
tdf.groupby('sex').count()

In [ ]:
tdf.groupby('sex').apply(lambda x: x.count())[['survived']] # survived의 성별만 출력 lambda 함수 적용해서 카운트

In [ ]:
# sibsp, parch 컬럼 원소에 1을 추가해 주세요

tdf_e1 = tdf[['parch','sibsp']].apply(lambda x: x + 1)
tdf_e1

In [ ]:
# 사용자 함수를 사용해 대문자로 바꿔주기
def uppercase(x):
    return x.upper()

tdf.sex.apply(uppercase)[:3] # tdf.sex라는 시리즈에 uppercase를 적용  결과 : 시리즈 출력

In [ ]:
len(tdf.age.unique())

In [ ]:
# age 컬럼을 범주화하여 새로운 age_class 컬럼을 생성하세요
def age_tran(a):
    if a < 16:
        a = '어린이'
    elif a < 31:
        a = '청년'
    elif a < 51:
        a = '장년'
    elif a < 66:
        a = '중년'
    else:
        a = '노년'
    return a
tdf_1 = tdf.copy()

tdf_1['age'] = tdf['age'].fillna(int(tdf.age.mean()))
age_class = tdf['age'].apply(age_tran)
tdf_1['age_class'] = age_class
tdf_1

In [ ]:
tdf_1.age_class.value_counts()

In [ ]:
df1 = tdf[['survived','pclass','sex']]
df1

In [ ]:
# df1에서 pclass가 3인 승객의 수를 구하세요
res_1 = df1['pclass'].value_counts()[3] # pclass 컬럼의 3의 값의 수를 카운트 하라
res_1

In [ ]:
len(list(filter(lambda a : a == 3,df1.pclass)))

In [ ]:
tdf.embark_town.isnull().sum()

In [ ]:
# embark_town 열의 NaN 값을 바로 앞에 있는 값으로 변경
tdf.embark_town.fillna(method='ffill',inplace=True)
# embark_town 열의 NaN 값을 바로 뒤에 있는 값으로 변경
# tdf.embark_town.fillna(method='bfill',inplace=True)
tdf.embark_town[827:831]

In [ ]:
import pandas as pd
fifa = pd.read_csv('dataset/FIFA.csv',encoding='cp949')
fifa.head()

In [ ]:
fifa.shape

In [ ]:
# 선수들 height 값을 cm로 변환하여 새로운 컬럼 생성
def tran(a):
    i, v = map(int,a.split("\'"))
    result = i * 30.48 + v * 2.54
    return result
fifa['cm'] = fifa.Height.apply(tran)
fifa.head(10)

In [ ]:
y = ax + b
y = a(x1,x2,x3) + b
y = aX + b

In [ ]:
fifa.info()

In [ ]:
# 과제 (오후 안에 끝내고 OPEN API과제 하기 5명)
# 선수들의 연봉/wage를 예측하는 모델 구축
# 주어진 데이터를 전처리 및 탐색하여 모델에 적합한 분석용 데이터셋을 작성하고 그 근거를 설명하세요.
# 10개 이상 전처리
fifa.corr() # 데이터 상관관계 파악 (Value, Release_Clause, Overall)
sns.heatmap(fifa.corr(), annot = True, cmap = 'viridis')

In [ ]:
t = fifa.drop(['ID','Name','Preferred_Foot','Work_Rate','Height','Weight_lb','cm'],axis=1) # 연봉과 상관관계가 낮은 불필요한 컬럼들 삭제
t

In [ ]:
# 연봉을 단위별로 구분해 1 ~ 12 등급으로 구분
t.describe()['Wage'] # 연봉 등급 세분화 원소 평균을 기준으로 1단계씩 상승 ex)11등급 = (min + std) 10등급 = 11등급 + std...

In [ ]:
def wage_c(a): # 등급 = Wage_d
    g = 9.618375
    if a < g:
        a = 12
    elif a < (g*2):
        a = 11 
    elif a < (g*3):
        a = 10
    elif a < (g*4):
        a = 9
    elif a < (g*5):
        a = 8
    elif a < (g*6):
        a = 7
    elif a < (g*7):
        a = 6
    elif a < (g*8):
        a = 5 
    elif a < (g*8):
        a = 4 
    elif a < (g*10):
        a = 3
    elif a < (g*11):
        a = 2 
    else:
        a = 1
    return a

wa_cla = t['Wage'].apply(wage_c)
t['Wage_d'] = wa_cla
t

In [ ]:
dt2 = t[['Nationality','Wage_d','Overall']].groupby(['Nationality']).mean() # 나라별 평균 등급, 오버롤
pd.set_option('max_rows',10)
dt2.sort_values(['Wage_d']) # 오버롤이 높은 나라순

In [ ]:
dt = t[['Release_Clause','Value','Overall','Wage_d']].groupby(['Wage_d']).mean() # 등급 별 평균 값(상관관계 올라감)
dt.corr()

In [ ]:
cw = t[['Club','Wage']].groupby(['Club']).mean()
c_top = cw.sort_values(by=['Wage'],axis=0,ascending=False) # 평균 연봉이 높은 팀 상위 10개
sns.heatmap(c_top.head(10), cmap = 'viridis')

In [ ]:
# 불필요한 변수 필터링(결측값 처리)
# 파생변수 생성
# 그룹화
# 데이터 타입 변경
# 상관관계 파악
# 중복변수 제거
# 이상치
# 사용가능 데이터로 변환

In [ ]:
# 중복
import pandas as pd
import numpy as np
arr = np.array([1,2,1,2,2,3,3,3])
data = arr.reshape(4,2)
df = pd.DataFrame(data, columns=['a','b'])
df

In [ ]:
df1 = df.copy()
df1.drop_duplicates() # 중복을 제거하는 함수 / 같은행이 있다면 삭제

In [ ]:
df2 = df.copy()
df2.drop_duplicates(subset=['b']) # subset 기준으로 제거

In [ ]:
df3 = df.copy()
df3.drop_duplicates(subset='b',keep='last') # keep = 마지막을 남겨라

In [ ]:
# 컬럼 이름 변경
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head()

In [ ]:
titanic['sex'].replace({'male':0,'female':1},inplace=True)

In [ ]:
# 열 이름 변경
titanic.rename(columns={'sex':'gender','age':'age_cat'},inplace=True)
titanic.head()

In [ ]:
# 컬럼 명을 대문자로 변경
titanic.rename(columns = str.upper,inplace=True)
# 소문자로 변경
titanic.rename(columns = str.lower,inplace=True)
titanic.head()

In [ ]:
titanic = titanic[['survived','pclass','gender','class']]
titanic

In [ ]:
titanic = titanic.reindex(['pclass','gender','class','survived'],axis=1)
titanic.head()

In [ ]:
df = titanic['gender'].replace({0:'male',1:'female'})
# titanic['gender'].replace(['1','0'],['female','male'],inplace=True)
df.head()

In [ ]:

# 인코딩 - LabelEncoder
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
features = ['gender','class']
for feature in features:
    df[feature] = le.fit_transform(df[feature])

df.head()

In [ ]:
import warnings
warnings.filterwarnings('ignore')

titanic.rename(columns = {'sex' : 'gender', 'class':'c_level'}, inplace = True)



new_order = ['pclass','gender','c_level','survived']

df = titanic[new_order]
df.gender.replace({1:'female',0:'male'},inplace=True)
df


from sklearn.preprocessing import LabelEncoder

#le라는 객체를 LabelEncoder에 만듬
le = LabelEncoder()
features = ['gender','c_level']

#인코딩해줌
#fit_transform() << 인코딩해줌
#준비_실행()
for feature in features:
    df[feature] = le.fit_transform(df[feature]) #df의 feature를 해줘야 찾을 ㅅ 있음 

df.head()

In [ ]:
df.gender.value_counts()

In [ ]:
df.c_level.value_counts()

In [ ]:
# 과제
# embarked, who, adult_male을 LabelEncoding
from sklearn.preprocessing import LabelEncoder
tran = LabelEncoder()
total = ['embarked','who','adult_male']

for i in total:
    titanic[i] = tran.fit_transform(titanic[i])

titanic

In [ ]:
ti1 = titanic[['gender','c_level']].copy()
ti1.head()

In [ ]:
# 인코딩 - OneHotEncoder 희소행렬
# 선택 경우의 수가 5개면 컬럼이 5개가 됨
# ex) gender컬럼이 gender_female,gender_male로 변환됨
# 컬럼이 넓어짐 분석 할 공간이 넓어져 패턴을 분석하기 어려움(과대적합) %시험 문제 반드시 나옴%

In [ ]:
pd.get_dummies(ti1).head()

In [ ]:
from sklearn.datasets import load_boston
boston = load_boston()
boston.keys()
boston.target
boston.DESCR
df_boston = pd.DataFrame(boston.data, columns=boston.feature_names) # boston.feature_names가 이미 리스트라서 [안에] 넣어서 리스트로 만들 이유가 없다.
# boston의 data 안에는 target이라는 변수가 없어서
df_boston['target'] = boston.target # 나중에 따로 넣어준다.
df_boston.head()

In [ ]:
data : 데이터셋의 정보가 numpy.ndarray 형태로 저장
target : 레이블 정보
feature_names : 데이터셋의 컬럼정보
DESCR : 데이터셋 설명
filename : 해당 데이터셋의 저장 위치 정보 표시]

In [ ]:
df_boston.info()

In [ ]:
# 스케일링 - 정규화
# MinMaxScaler = 0~1까지
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

df_boston['RM'] = scaler.fit_transform(df_boston[['RM']])
df_boston.head()

In [ ]:
df_boston.RM.mean()

In [ ]:
# 과제
# df_boston 전체 컬럼에 대하여 정규화를 수행하세요
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

df_boston[:] = scaler.fit_transform(df_boston[:])
df_boston
# 왜 되는지 모르겠음 다시 한번 보기 #

In [ ]:
# 스케일링 - 표준화
# 가우시안정규분포 표준편차가 1인 분포
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

df_boston['INDUS'] = scaler.fit_transform(df_boston[['INDUS']])
df_boston

In [ ]:
df_boston.INDUS.mean()
# 2.1063519834785578e-16 / 소수점이 16번째 자리
df_boston.INDUS.std() 
# 표준편차 1

In [ ]:
# 과제
# df_boston 전체 컬럼에 대하여 표준화를 수행하세요
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

df_boston[:] = scaler.fit_transform(df_boston[:])
df_boston
# 왜 되는지 모르겠따

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

plt.style.use('seaborn-dark')

plt.figure(figsize=(10,8))
sns.distplot(df_boston[['target']])

In [ ]:
# 로그 변환
import numpy as np
df_boston[['target']] = np.log1p(df_boston[['target']])
# np.log1p로 기존에 타겟에 있는 숫자들을 로그로 변환

plt.figure(figsize=(10,8))
sns.distplot(df_boston[['target']])
# 지수 함수 : 기하급수적으로 늘어남
# 로그 함수 : 완만하게 증가
# 로그 변환 : 정규분포에 가깝게 하기 위한 과정

In [ ]:
# 로그 변환 환원
df_boston['target'] = np.expm1(df_boston[['target']])
df_boston.head()

In [ ]:
import seaborn as sns
titanic

In [ ]:
import seaborn as sns

df = sns.load_dataset('titanic')
df = df.loc[:,['age','sex','class','fare','survived']]
# df = df[['age','sex','class','fare','survived']]
df.head()

In [ ]:

df['class'].value_counts # 예약어를 문자열로 인식해 따로 예약어로 처리되지 않음
# df.class.value_counts() # 예약어라서 실행 안됨

In [203]:
df.rename(columns={'class':'c_level'},inplace=True)
df.c_level.value_counts()

Third     491
First     216
Second    184
Name: c_level, dtype: int64

In [208]:
grouped = df.groupby(['c_level'])
print(grouped) # 그룹 한 객체만 출력되고 조건이 없음

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x14b1202b0>

In [210]:
list(grouped) # 객체의 내용들을 리스트로 출력

[('First',
        age     sex c_level     fare  survived
  1    38.0  female   First  71.2833         1
  3    35.0  female   First  53.1000         1
  6    54.0    male   First  51.8625         0
  11   58.0  female   First  26.5500         1
  23   28.0    male   First  35.5000         1
  ..    ...     ...     ...      ...       ...
  871  47.0  female   First  52.5542         1
  872  33.0    male   First   5.0000         0
  879  56.0  female   First  83.1583         1
  887  19.0  female   First  30.0000         1
  889  26.0    male   First  30.0000         1

  [216 rows x 5 columns]),
 ('Second',
        age     sex c_level     fare  survived
  9    14.0  female  Second  30.0708         1
  15   55.0  female  Second  16.0000         1
  17    NaN    male  Second  13.0000         1
  20   35.0    male  Second  26.0000         0
  21   34.0    male  Second  13.0000         1
  ..    ...     ...     ...      ...       ...
  866  27.0  female  Second  13.8583         1
  874  28.0  female  Second  24.0000         1
  880  25.0  female  Second  26.0000         1
  883  28.0    male  Second  10.5000         0
  886  27.0    male  Second  13.0000         0

  [184 rows x 5 columns]),
 ('Third',
        age     sex c_level     fare  survived
  0    22.0    male   Third   7.2500         0
  2    26.0  female   Third   7.9250         1
  4    35.0    male   Third   8.0500         0
  5     NaN    male   Third   8.4583         0
  7     2.0    male   Third  21.0750         0
  ..    ...     ...     ...      ...       ...
  882  22.0  female   Third  10.5167         0
  884  25.0    male   Third   7.0500         0
  885  39.0  female   Third  29.1250         0
  888   NaN  female   Third  23.4500         0
  890  32.0    male   Third   7.7500         0

  [491 rows x 5 columns])]

In [213]:
for key,group in grouped:
    print('* Key : ',key)
    print('* Number : ',len(group))
    print(group.head(),'\n')

* Key :  First
* Number :  216
     age     sex c_level     fare  survived
1   38.0  female   First  71.2833         1
3   35.0  female   First  53.1000         1
6   54.0    male   First  51.8625         0
11  58.0  female   First  26.5500         1
23  28.0    male   First  35.5000         1

* Key :  Second
* Number :  184
     age     sex c_level     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1

* Key :  Third
* Number :  491
    age     sex c_level     fare  survived
0  22.0    male   Third   7.2500         0
2  26.0  female   Third   7.9250         1
4  35.0    male   Third   8.0500         0
5   NaN    male   Third   8.4583         0
7   2.0    male   Third  21.0750         0

In [214]:
average = grouped.mean()
average

               age       fare  survived
c_level
First    38.233441  84.154687  0.629630
Second   29.877630  20.662183  0.472826
Third    25.140620  13.675550  0.242363

In [215]:
max = grouped.max()
max

          age   sex      fare  survived
c_level
First    80.0  male  512.3292         1
Second   70.0  male   73.5000         1
Third    74.0  male   69.5500         1

In [221]:
from IPython.display import display, HTML
average = grouped.mean()
display(HTML(average.to_html()))
maxs = grouped.max()

display(HTML(maxs.to_html()))

In [235]:
a = grouped.groups['Third']
group3 = df.loc[a]
group3

      age     sex c_level     fare  survived
0    22.0    male   Third   7.2500         0
2    26.0  female   Third   7.9250         1
4    35.0    male   Third   8.0500         0
5     NaN    male   Third   8.4583         0
7     2.0    male   Third  21.0750         0
..    ...     ...     ...      ...       ...
882  22.0  female   Third  10.5167         0
884  25.0    male   Third   7.0500         0
885  39.0  female   Third  29.1250         0
888   NaN  female   Third  23.4500         0
890  32.0    male   Third   7.7500         0

[491 rows x 5 columns]

In [238]:
group3 = grouped.get_group('Third')
group3.describe()

              age        fare    survived
count  355.000000  491.000000  491.000000
mean    25.140620   13.675550    0.242363
std     12.495398   11.778142    0.428949
min      0.420000    0.000000    0.000000
25%     18.000000    7.750000    0.000000
50%     24.000000    8.050000    0.000000
75%     32.000000   15.500000    0.000000
max     74.000000   69.550000    1.000000

In [239]:
group1 = grouped.get_group('First')
group1.describe()

              age        fare    survived
count  186.000000  216.000000  216.000000
mean    38.233441   84.154687    0.629630
std     14.802856   78.380373    0.484026
min      0.920000    0.000000    0.000000
25%     27.000000   30.923950    0.000000
50%     37.000000   60.287500    1.000000
75%     49.000000   93.500000    1.000000
max     80.000000  512.329200    1.000000

In [ ]:
 #class열, sex열을 기준으로 분할하여 grouped_two에 저장하세요

In [245]:
grouped_two = df.groupby(['c_level','sex'])
for key, group in grouped_two:
    print('* keys : ',key)
    print('* number : ',len(group))
    print(grouped_two.head())

* keys :  ('First', 'female')
* number :  94
     age     sex c_level      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
* keys :  ('First', 'male')
* number :  122
     age     sex c_level      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
* keys :  ('Second', 'female')
* number :  76
     age     sex c_level      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
* keys :  ('Second', 'male')
* number :  108
     age     sex c_level      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
* keys :  ('Third', 'female')
* number :  144
     age     sex c_level      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0
* keys :  ('Third', 'male')
* number :  347
     age     sex c_level      fare  survived
0   22.0    male   Third    7.2500         0
1   38.0  female   First   71.2833         1
2   26.0  female   Third    7.9250         1
3   35.0  female   First   53.1000         1
4   35.0    male   Third    8.0500         0
5    NaN    male   Third    8.4583         0
6   54.0    male   First   51.8625         0
7    2.0    male   Third   21.0750         0
8   27.0  female   Third   11.1333         1
9   14.0  female  Second   30.0708         1
10   4.0  female   Third   16.7000         1
11  58.0  female   First   26.5500         1
12  20.0    male   Third    8.0500         0
14  14.0  female   Third    7.8542         0
15  55.0  female  Second   16.0000         1
17   NaN    male  Second   13.0000         1
18  31.0  female   Third   18.0000         0
20  35.0    male  Second   26.0000         0
21  34.0    male  Second   13.0000         1
23  28.0    male   First   35.5000         1
27  19.0    male   First  263.0000         0
30  40.0    male   First   27.7208         0
31   NaN  female   First  146.5208         1
33  66.0    male  Second   10.5000         0
34  28.0    male   First   82.1708         0
41  27.0  female  Second   21.0000         0
43   3.0  female  Second   41.5792         1
52  49.0  female   First   76.7292         1
53  29.0  female  Second   26.0000         1
70  32.0    male  Second   10.5000         0

In [249]:
# 그룹 객체에 연산메소드 적용, 각 그룹의 평균값을 구한 후 출력하세요
avg_2 = grouped_two.mean()

avg_2

                      age        fare  survived
c_level sex
First   female  34.611765  106.125798  0.968085
        male    41.281386   67.226127  0.368852
Second  female  28.722973   21.970121  0.921053
        male    30.740707   19.741782  0.157407
Third   female  21.750000   16.118810  0.500000
        male    26.507589   12.661633  0.135447

In [255]:
# df에서 class, sex 컬럼으로 그룹화를 수행한 후에 ('Third',female) 그룹을 선택해서
# group3f에 저장하고 처음 5개 행을 출력하세요

group3f = grouped_two.get_group(('Third','female')) # 키 값이 튜플로 입력 되어 있어서 뽑는 명령도 튜플로 해줘야 됨
group3f.head()

     age     sex c_level     fare  survived
2   26.0  female   Third   7.9250         1
8   27.0  female   Third  11.1333         1
10   4.0  female   Third  16.7000         1
14  14.0  female   Third   7.8542         0
18  31.0  female   Third  18.0000         0

#### 적용-결합
데이터 집계 (aggregation agg)
-집계 연산을 처리하는 사용자 정의 함수를 그룹 객체에 적용하려면 agg() 메서드 사용.
-모든 열에 여러 함수를 매핑: group 객체 . agg ([함수1.함수2...])
-각 열마다 다른 함수를 매핑: group 객체 . agg ({'열1':함수1,...})

변환(transform)
-원소의 본래 행 인덱스와 열 이름을 기준으로 연산 결과를 반환
-데이터 변환 연산 : group 객체. transform(매핑함수)

필터링(filter)
-그룹 객체에 filter()메서드를 적용할 때 조건식을 가진 함수를 전달하면 조건이 참인 그룹만을 남김
-그룹 객체 필터링: group 객체. filter(조건함수식)

객체에 함수 매핑(apply)
-판다스 객체의 개별 원소를 특정 함수에 일대일로 매핑. 사용자가 원하는 대부분의 연산을 그룹 객체에 적용
-group 객체 . apply(매핑함수)

In [262]:
# 최대값 - 최소값을 반환하는 사용자 함수를 정의하고 agg()함수에 인수로
# 전달하여 그룹별로 집계하여 agg_minmax 이름으로 저장 후 처음 5개 행을 출력하세요

def mm(a):
    result = a.max() - a.min()
    return result

agg_minmax = grouped.agg(mm)
agg_minmax.head()

           age      fare  survived
c_level
First    79.08  512.3292         1
Second   69.33   73.5000         1
Third    73.58   69.5500         1

In [263]:
# 모든 열에 여러 함수를 매핑 : group객체.agg([함수1,함수2,...])
# 각 열마다 다른 함수 매핑 : group객체.agg({'열1' : 함수1, '열2' : 함수2,...})
agg_all = grouped.agg(['min','max'])
agg_all

          age           sex       fare           survived
          min   max     min   max  min       max      min max
c_level
First    0.92  80.0  female  male  0.0  512.3292        0   1
Second   0.67  70.0  female  male  0.0   73.5000        0   1
Third    0.42  74.0  female  male  0.0   69.5500        0   1

In [264]:
# fare는 min,max age는 mean
agg_dual = grouped.agg({'fare':['min','max'],'age':'mean'})
agg_dual

        fare                  age
         min       max       mean
c_level
First    0.0  512.3292  38.233441
Second   0.0   73.5000  29.877630
Third    0.0   69.5500  25.140620

In [272]:
# 데이터 개수가 200개 이상인 그룹만을 필터링하여 데이터 프레임으로 반환하여
# grouped_filter 이름으로 저장 후 처음 5개 행을 출력하세요


grouped_filter = grouped.filter(lambda x : len(x) >= 200)
grouped_filter['c_level'].value_counts()

Third     491
First     216
Second      0
Name: c_level, dtype: int64

In [277]:
# age 열의 평균이 30보다 작은 그룹만을 필터링하여 데이터프레임으로 반환하여
# age_filter 이름으로 저장 후 끝에서 5개 행을 출력하세요
age_filter = grouped.filter(lambda x : x['age'].mean() < 30)
age_filter.tail()

      age     sex c_level    fare  survived
884  25.0    male   Third   7.050         0
885  39.0  female   Third  29.125         0
886  27.0    male  Second  13.000         0
888   NaN  female   Third  23.450         0
890  32.0    male   Third   7.750         0

In [284]:
# z-score : 평균 값에서 표준편차의 몇 배 떨어져 있는지를 평가하는 수치
#(단위가 다른 두 그룹을 비교하기 위해서는 z-score를 적용해서 단위를 일치 시켜야 한다)
# 분포에 퍼져있는 정도를 파악 / 표준정규분포를 통해 파악
def z_score(a):
    return (a - a.mean()) / a.std()

age_zscore = grouped['age'].apply(z_score)
age_zscore.head()

0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
Name: age, dtype: float64

In [283]:
age_zscore = grouped['age'].transform(z_score)
age_zscore.head()
# fit_transform = fit은 준비 transform은 변환

0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
Name: age, dtype: float64

In [291]:
age_filter = grouped.apply(lambda x : x.age.mean() < 30)
for x in age_filter.index:
    if age_filter[x] == True:
        age_filter_df = grouped.get_group(x)
        print(age_filter_df.head())

# filter, apply 차이 = filter는 해당 되는 것만 적용 apply는 전부 다 적용

     age     sex c_level     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
    age     sex c_level     fare  survived
0  22.0    male   Third   7.2500         0
2  26.0  female   Third   7.9250         1
4  35.0    male   Third   8.0500         0
5   NaN    male   Third   8.4583         0
7   2.0    male   Third  21.0750         0

In [302]:
age_filter

c_level
First     False
Second     True
Third      True
dtype: bool

## 피벗
- 피벗 테이블을 구성하는 4가지 요소(행 인덱스, 열 인덱스, 데이터 값, 데이터 집계함수)에 적용할 데이터프레임의 열을 각각 지정하여 함수의 인자로 전달

In [320]:

data_pv = pd.read_pickle('dataset/data_pv.pkl')

data_pv1 = data_pv.pivot( # 파이썬 피벗
    index = 'Country',
    columns='Indicator',
    values='Value'
    )
data_pv3 = pd.pivot(data_pv,index = 'Country',columns='Indicator',values='Value')
print()
print(data_pv.shape)
print(data_pv.info())
data_pv1.head()
pd.set_option('max_rows', None)
data_pv3

(888, 3)
<class 'pandas.core.frame.DataFrame'>
Int64Index: 888 entries, 0 to 3217
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    888 non-null    object
 1   Indicator  888 non-null    object
 2   Value      888 non-null    float64
dtypes: float64(1), object(2)
memory usage: 27.8+ KB
None

Indicator,Air pollution,Assault rate,Consultation on rule-making,Dwellings without basic facilities,Educational attainment,Employees working very long hours,Employment rate,Homicide rate,Household net adjusted disposable income,Household net financial wealth,...,Long-term unemployment rate,Personal earnings,Quality of support network,Rooms per person,Self-reported health,Student skills,Time devoted to leisure and personal care,Voter turnout,Water quality,Years in education
Country,,,,,,,,,,,,,,,,,,,,,
Australia,13.0,2.1,10.5,1.1,76.0,14.02,72.0,0.8,31588.0,47657.0,...,1.08,50449.0,92.0,2.3,85.0,512.0,14.41,93.0,91.0,19.4
Austria,27.0,3.4,7.1,1.0,83.0,7.61,72.0,0.4,31173.0,49887.0,...,1.19,45199.0,89.0,1.6,69.0,500.0,14.46,75.0,94.0,17.0
Belgium,21.0,6.6,4.5,2.0,72.0,4.57,62.0,1.1,28307.0,83876.0,...,3.88,48082.0,94.0,2.2,74.0,509.0,15.71,89.0,87.0,18.9
Brazil,18.0,7.9,4.0,6.7,45.0,10.41,67.0,25.5,11664.0,6844.0,...,1.97,17177.0,90.0,1.6,69.0,402.0,14.97,79.0,72.0,16.3
Canada,15.0,1.3,10.5,0.2,89.0,3.94,72.0,1.5,29365.0,67913.0,...,0.90,46911.0,92.0,2.5,89.0,522.0,14.25,61.0,91.0,17.2
Chile,46.0,6.9,2.0,9.4,57.0,15.42,62.0,4.4,14533.0,17733.0,...,1.59,22101.0,86.0,1.2,59.0,436.0,14.41,49.0,73.0,16.5
Czech Republic,16.0,2.8,6.8,0.9,92.0,6.98,68.0,0.8,18404.0,17299.0,...,3.12,20338.0,85.0,1.4,60.0,500.0,14.98,59.0,85.0,18.1
Denmark,15.0,3.9,7.0,0.9,78.0,2.03,73.0,0.3,26491.0,44488.0,...,1.78,48347.0,95.0,1.9,72.0,498.0,16.06,88.0,94.0,19.4
Estonia,9.0,5.5,3.3,8.1,90.0,3.30,68.0,4.8,15167.0,7680.0,...,3.82,18944.0,89.0,1.5,54.0,526.0,14.90,64.0,79.0,17.5
Finland,15.0,2.4,9.0,0.6,85.0,3.58,69.0,1.4,27927.0,18761.0,...,1.73,40060.0,95.0,1.9,65.0,529.0,14.89,69.0,94.0,19.7
France,12.0,5.0,3.5,0.5,73.0,8.15,64.0,0.6,28799.0,48741.0,...,3.99,40242.0,87.0,1.8,67.0,500.0,15.33,80.0,82.0,16.4
Germany,16.0,3.6,4.5,0.1,86.0,5.25,73.0,0.5,31252.0,50394.0,...,2.37,43682.0,94.0,1.8,65.0,515.0,15.31,72.0,95.0,18.2
Greece,27.0,3.7,6.5,0.7,68.0,6.16,49.0,1.6,18575.0,14579.0,...,18.39,25503.0,83.0,1.2,74.0,466.0,14.91,64.0,69.0,18.6
Hungary,15.0,3.6,7.9,4.8,82.0,3.19,58.0,1.3,15442.0,13277.0,...,5.10,20948.0,87.0,1.1,57.0,487.0,15.04,62.0,77.0,17.6
Iceland,18.0,2.7,5.1,0.4,71.0,12.25,82.0,0.3,23965.0,43045.0,...,1.18,55716.0,96.0,1.5,77.0,484.0,14.61,81.0,97.0,19.8
Ireland,13.0,2.6,9.0,0.2,75.0,4.20,60.0,0.8,23917.0,31580.0,...,8.39,49506.0,96.0,2.1,82.0,516.0,15.19,70.0,80.0,17.6
Israel,21.0,6.4,2.5,3.7,85.0,16.03,67.0,2.3,22104.0,52933.0,...,0.79,28817.0,87.0,1.2,80.0,474.0,14.48,68.0,68.0,15.8
Italy,21.0,4.7,5.0,1.1,57.0,3.66,56.0,0.7,25166.0,54987.0,...,6.94,34561.0,90.0,1.4,66.0,490.0,14.98,75.0,71.0,16.8
Japan,24.0,1.4,7.3,6.4,94.0,22.26,72.0,0.3,26111.0,86764.0,...,1.67,35405.0,89.0,1.8,30.0,540.0,14.93,53.0,85.0,16.3
Korea,30.0,2.1,10.4,4.2,82.0,18.72,64.0,1.1,19510.0,29091.0,...,0.01,36354.0,72.0,1.4,35.0,542.0,14.63,76.0,78.0,17.5
Luxembourg,12.0,4.3,6.0,0.1,78.0,3.47,66.0,0.4,38951.0,61765.0,...,1.78,56021.0,87.0,2.0,72.0,490.0,15.12,91.0,86.0,15.1
Mexico,30.0,12.8,9.0,4.2,37.0,28.83,61.0,23.4,13085.0,9056.0,...,0.08,16193.0,77.0,1.0,66.0,417.0,13.89,63.0,67.0,14.4
Netherlands,30.0,4.9,6.1,0.0,73.0,0.45,74.0,0.9,27888.0,77961.0,...,2.40,47590.0,90.0,2.0,76.0,519.0,15.44,75.0,92.0,18.7
New Zealand,11.0,2.2,10.3,0.2,74.0,13.87,73.0,1.2,23815.0,28290.0,...,0.75,35609.0,94.0,2.4,90.0,509.0,14.87,77.0,89.0,18.1
Norway,16.0,3.3,8.1,0.3,82.0,2.82,75.0,0.6,33492.0,8797.0,...,0.32,50282.0,94.0,2.0,76.0,496.0,15.56,78.0,94.0,17.9
OECD - Total,20.0,3.9,7.3,2.4,75.0,12.51,65.0,4.0,25908.0,67139.0,...,2.79,36118.0,88.0,1.8,68.0,497.0,14.97,68.0,81.0,17.7
Poland,33.0,1.4,10.8,3.2,90.0,7.41,60.0,0.9,17852.0,10919.0,...,3.77,22655.0,91.0,1.1,58.0,521.0,14.20,55.0,79.0,18.4
Portugal,18.0,5.7,6.5,0.9,38.0,9.62,61.0,1.1,20086.0,31245.0,...,9.11,23688.0,86.0,1.6,46.0,488.0,14.95,58.0,86.0,17.6
Russia,15.0,3.8,2.5,15.1,94.0,0.16,69.0,12.8,19292.0,3412.0,...,1.70,20885.0,90.0,0.9,37.0,481.0,14.97,65.0,56.0,16.0
Slovak Republic,13.0,3.0,6.6,0.6,92.0,7.02,60.0,1.2,17503.0,8663.0,...,9.46,20307.0,90.0,1.1,66.0,472.0,14.99,59.0,81.0,16.3
Slovenia,26.0,3.9,10.3,0.5,85.0,5.63,63.0,0.4,19326.0,18465.0,...,5.15,32037.0,90.0,1.5,65.0,499.0,14.62,52.0,88.0,18.4
Spain,24.0,4.2,7.3,0.1,55.0,5.89,56.0,0.6,22477.0,24774.0,...,12.96,34824.0,95.0,1.9,72.0,490.0,16.06,69.0,71.0,17.6
Sweden,10.0,5.1,10.9,0.0,88.0,1.13,74.0,0.7,29185.0,60328.0,...,1.37,40818.0,92.0,1.7,81.0,482.0,15.11,86.0,95.0,19.3
Switzerland,20.0,4.2,8.4,0.0,86.0,6.72,80.0,0.5,33491.0,108823.0,...,1.46,54236.0,96.0,1.8,81.0,518.0,14.98,49.0,96.0,17.3
Turkey,35.0,5.0,5.5,12.7,34.0,40.86,50.0,1.2,14095.0,3251.0,...,2.37,16919.0,86.0,1.1,68.0,462.0,13.42,88.0,62.0,16.4
United Kingdom,13.0,1.9,11.5,0.2,78.0,12.70,71.0,0.3,27029.0,60778.0,...,2.77,41192.0,91.0,1.9,74.0,502.0,14.83,66.0,88.0,16.4
United States,18.0,1.5,8.3,0.1,89.0,11.30,67.0,5.2,41355.0,145769.0,...,1.91,56340.0,90.0,2.4,88.0,492.0,14.27,68.0,85.0,17.2

In [319]:
# 행은 class, 열은 sex로 구성된 피벗 테이블 출력 value = age 평균값
import seaborn as sns

df = sns.load_dataset('titanic')
titanic_df = df[['age','sex','class','fare','survived']]
gp = titanic_df.pivot_table(
    index='class',
    columns='sex',
    values='age',
    aggfunc='mean'
    )
gp

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [318]:
pdf1 = pd.pivot_table(
    titanic_df,
    index='class',
    columns='sex',
    values='age',
    aggfunc='mean'
    )
pdf1

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [317]:
# 값에 적용하는 집계 함수를 2개 이상 지정 할 수 있다. mean, sum을 지정하여 출력하세요 values = survived
pdf2 = pd.pivot_table(
    titanic_df,
    index='class',
    columns='sex',
    values='survived',
    aggfunc=['mean','sum']
    )
pdf2

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [323]:
# 행, 열, 값에 사용할 열을 2개 이상 지정 할 수 있다. index, values, aggfunc에
# 각각 2개를 지정하여 출력하세요
pdf3 = pd.pivot_table(
    titanic_df,
    index=['class','sex'],
    columns='survived',
    values=['age','fare'],
    aggfunc=['mean','max']
    )
pdf3

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0
       male    27.255814  22.274211   12.204469   15.579696  74.0  45.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875
       male     69.55   56.4958

In [459]:
# 과제1
# titanic 데이터셋에 대한 탐색을 통하여 그룹 조합별 인사이트 5개 이상을
# 도출하여 기술하세요.
import seaborn as sns
import pandas as pd

tt_df = sns.load_dataset('titanic')
pd.set_option('max_rows',20)
tt_df.isnull().sum() # 필요한 컬럼 중 age에 177개의 NaN 값이 있다 값을 채워서 NaN 값을 지워줘야한다
t_df = tt_df[['survived','sex','age','class','fare']]
t_df2 = tt_df[['alone','survived','age','class','fare']]
t_df['age'].fillna(method='ffill',inplace=True) # NaN 값 기준 앞에 있는 값으로 NaN 값을 채운다.
t_df.isnull().sum()

pdfz = pd.pivot_table(
    t_df,
    index=['class','sex'],
    columns='survived',
    values=['fare','age'],
    aggfunc=['mean','sum']
    )

pdfz2 = pd.pivot_table(
    t_df2,
    index=['class','alone'],
    columns='survived',
    values=['age','fare'],
    aggfunc=['mean','sum']
    )

print(pdfz)

# 클래스가 높아질 수록 평균 나이, 생존률이 올라간다.
# First 클래스와 Second 클래스의 차이는 많이 나지만 Second와 Third는 차이가 크게 나지 않는다.
# 여성들이 남성들 보다 더 많은 값을 지불했다.

print(pdfz2)

# 혼자가 아닌 사람들이 가격을 많이 지불하는 걸로 보아 가족단위의 탑승객이 아 졸렵다

                    mean                                         sum           \
                     age                   fare                  age
survived               0          1           0           1        0        1
class  sex
First  female  25.666667  34.054066  110.604167  105.978159    77.00  3098.92
       male    41.181818  35.931556   62.894910   74.637320  3171.00  1616.92
Second female  36.000000  28.064286   18.250000   22.288989   216.00  1964.50
       male    33.032967  15.372353   19.488965   21.095100  3006.00   261.33
Third  female  25.402778  24.187500   19.773093   12.464526  1829.00  1741.50
       male    27.848600  21.711064   12.204469   15.579696  8354.58  1020.42


                    fare
survived               0          1
class  sex
First  female   331.8125  9644.0125
       male    4842.9081  3358.6794
Second female   109.5000  1560.2292
       male    1773.4958   358.6167
Third  female  1423.6627   897.4459
       male    3661.3408   732.2457
                   mean                                        sum           \
                    age                   fare                 age
survived              0          1           0           1       0        1
class  alone
First  False  39.000000  34.562254  105.783476  104.735740  1131.0  2453.92
       True   47.585714  36.490196   41.313722   83.332831  1665.5  1861.00
Second False  32.827586  21.163333   31.443966   27.982190   952.0  1079.33
       True   33.885246  33.453125   14.281188   13.659839  2067.0  1070.50
Third  False  21.967391  14.497895   24.611364   16.620414  2021.0   550.92
       True   28.926966  25.617021    8.648917   11.574941  5149.0  1204.00


                   fare
survived              0          1
class  alone
First  False  3067.7208  8169.3877
       True   2106.9998  4833.3042
Second False   911.8750  1427.0917
       True    971.1208   491.7542
Third  False  2879.5296   831.0207
       True   2205.4739   798.6709

In [464]:
# 과제2
# auto-mpg.csv 데이터에서 horsepower 열의 고유 값을 출력하세요
# horsepower 열의 누락 데이터를 삭제한 후 NaN 값의 갯 수를 출력하세요
# horsepwer의 타입을 실수형으로 변환한 후 자료형을 확인하고 auto_df.pkl로
# 저장 후 다시 불러와서 출력하세요.
import pandas as pd
import numpy as np

data = pd.read_csv('dataset/auto-mpg.csv')
data['horsepower'].unique()
data['horsepower'].isnull().sum() # 누락 데이터 없음 Nan 값 0
data['horsepower'].replace('?',np.nan,inplace=True)
data.dropna(subset=['horsepower'],inplace=True)
data['horsepower'].isnull().sum()
data['horsepower'] = data['horsepower'].astype(float)
# Q. horsepower의 타입을 실수형으로 변환한 후 자료형을 확인하고 auto_df.pkl로
data.to_pickle('dataset/auto_df.pkl')
data1 = pd.read_pickle('dataset/auto_df.pkl')
print(data['horsepower'].dtype)
# 저장 후 다시 불러와서 출력하세요.

float64

In [442]:
# 과제3
# horsepower 열의 최대 값의 절대 값으로 모든 데이터를 나누는 정규화를 수행한 후
# 통계요약표를 출력하세요.
data1['horsepower'] = data1['horsepower'].apply(lambda x : x / abs(data1['horsepower'].max()))
data1['horsepower'].describe()

count    392.000000
mean       0.454215
std        0.167353
min        0.200000
25%        0.326087
50%        0.406522
75%        0.547826
max        1.000000
Name: horsepower, dtype: float64

In [465]:
# 과제4
# origin 열의 고유값을 출력하세요
# 정수형 데이터를 문자형 데이터로 변환한 후 고유값을 출력하세요.
# (1:'USA',2:'EU',3:'JAPAN')
data = pd.read_csv('dataset/auto-mpg.csv')
data['origin'].unique()
data['origin'].dtype
data['origin'].replace({1:'USA',2:'EU',3:'JAPAN'},inplace=True)
data['origin'].unique()

array(['USA', 'JAPAN', 'EU'], dtype=object)

In [466]:
# 과제5
# origin 열의 자료형을 확인하고 범주형(category)으로 변환하여 출력하세요
print(data['origin'].dtype)
data['origin'] = data['origin'].astype('category')
print(data['origin'].dtype)

object
category

In [443]:
# 과제6
#origin 열을 범주형에서 문자열로 변환한 후 자료형을 출력하세요.
print(data['origin'].dtype)
data['origin'] = data['origin'].astype(str)
print(data['origin'].dtype)

int64
object

In [454]:
# 과제7
# horsepower를 3개의 bin으로 나누고 bin_names = ['저출력', '보통출력','고출력']
# 으로 출력하세요.(np.histogram() 함수로 3개의 bin으로 나눔)
bin_names = ['저출력', '보통출력','고출력']
count, binz = np.histogram(data1.horsepower,bins=3)
data1['hp'] = pd.cut(
    x = data1['horsepower'],
    bins = binz,
    labels = bin_names,
    include_lowest=True
)
data1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,hp
0,18.0,8,307.0,0.565217,3504,12.0,70,1,chevrolet chevelle malibu,보통출력
1,15.0,8,350.0,0.717391,3693,11.5,70,1,buick skylark 320,보통출력
2,18.0,8,318.0,0.652174,3436,11.0,70,1,plymouth satellite,보통출력
3,16.0,8,304.0,0.652174,3433,12.0,70,1,amc rebel sst,보통출력
4,17.0,8,302.0,0.608696,3449,10.5,70,1,ford torino,보통출력

In [ ]:
# 통계
# 전체를 다 조사를 할 수 없으니까 표본을 추출해서 그걸로 파악
#분포 / 2000인 그룹 2개 a = 편차가 3 : 낮은 종 모양 / b = 편차가 1 : 뾰족한 종 모양(b 그룹에 비해 a 그룹이 3배 퍼져있음)

In [ ]:
# class로 그룹된 grouped를
# age가 평균 30미만인 것들만 모아서
# age_filter라는 변수로 만듦.

# 그렇다면 age_filter가 모수?가 되고
# 해당되는 age_filter의 값들은 행(index)로 저장되니까
# for문을 돌려서 x로 모수(age_filter)에서 뺸다

In [ ]:
# 편차 = 평균으로부터 떨어진 거리
# 시그마 = 표준편차